[
  {
    "id": 1,
    "title": "AIFA Baby Cloud",
    "shortDec": "Full-featured e-commerce platform for baby products with real-time inventory",
    "description": "A sophisticated e-commerce platform specializing in baby clothing and products. Features include real-time inventory management, secure payment processing, user authentication with Firebase Auth, responsive product catalog with filtering and search, shopping cart with persistent state, order tracking, and an intuitive admin dashboard for inventory management.",
    "img": "/img/projects/aifa-cloud.png",
    "category": "web",
    "technologies": ["React", "Firebase Auth", "Firestore", "Firebase Storage", "Vite", "Tailwind CSS"],
    "liveUrl": "https://aifa-cloud.netlify.app",
    "githubUrl": "https://github.com/ayoobnazzz/AIFA-Ecommerce-React",
    "featured": true
  },
  {
    "id": 2,
    "title": "Score-wire",
    "shortDec": "Real-time sports analytics platform with live game updates and player stats",
    "description": "An advanced sports analytics platform delivering real-time game scores, comprehensive player statistics, and live match updates. Built with React for a responsive UI, GraphQL with Apollo Server for efficient data fetching, and WebSocket connections for instant score updates. Features include team standings, player performance metrics, historical game data, and interactive data visualizations.",
    "img": "/img/projects/score-wire.png",
    "category": "web",
    "technologies": ["React", "TypeScript", "GraphQL", "Apollo Server", "WebSocket", "D3.js"],
    "liveUrl": "https://score-wire.onrender.com/",
    "githubUrl": "",
    "featured": true
  },
  {
    "id": 3,
    "title": "Fit-stack",
    "shortDec": "Comprehensive fitness tracking app with personalized workout plans and progress analytics",
    "description": "A full-stack fitness management application designed to help users achieve their fitness goals. Features include an extensive exercise library with video demonstrations, customizable workout routines, progress tracking with visual analytics, nutrition logging, workout history, goal setting with milestone tracking, and social features for sharing achievements. Secured with Supabase Auth and JWT tokens for user data protection.",
    "img": "/img/projects/fit-stack.png",
    "category": "web",
    "technologies": ["React", "Node.js", "Express", "MongoDB", "Supabase Auth", "JWT", "Chart.js"],
    "liveUrl": "https://fit-stack.onrender.com/",
    "githubUrl": "",
    "featured": true
  }
]
